MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_qspi.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_qspi.c
 **
 ** A detailed description is available at
 ** @link QspiGroup Queued SPI description @endlink
 **
 **   - 2018-11-20  1.0  Yangjp  First version for Device Driver Library of Qspi.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_qspi.h"
#include "hc32f46x_utility.h"

#if (DDL_QSPI_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup QspiGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*!< Parameter valid check for clock division */
#define IS_VALID_CLK_DIV(x)   \
    (((x) == QspiHclkDiv2) || \
     (((x) >= QspiHclkDiv3) && ((x) <= QspiHclkDiv64)))

/*!< Parameter valid check for spi mode */
#define IS_VALID_SPI_MODE(x)  \
    ((QspiSpiMode0 == (x)) || \
     (QspiSpiMode3 == (x)))

/*!< Parameter valid check for bus communication mode */
#define IS_VALID_BUS_COMM_MODE(x)     \
    ((QspiBusModeRomAccess == (x)) || \
     (QspiBusModeDirectAccess == (x)))

/*!< Parameter valid check for prefetch stop location */
#define IS_VALID_PREFETCH_STOP_LOCATION(x) \
    ((QspiPrefetchStopComplete == (x)) ||  \
     (QspiPrefetchStopImmediately == (x)))

/*!< Parameter valid check for receive data protocol */
#define IS_VALID_RECE_DATA_PROTOCOL(x)   \
    ((QspiProtocolExtendSpi == (x)) ||   \
     (QspiProtocolTwoWiresSpi == (x)) || \
     (QspiProtocolFourWiresSpi == (x)))

/*!< Parameter valid check for transmit address protocol */
#define IS_VALID_TRANS_ADDR_PROTOCOL(x)  \
    ((QspiProtocolExtendSpi == (x)) ||   \
     (QspiProtocolTwoWiresSpi == (x)) || \
     (QspiProtocolFourWiresSpi == (x)))

/*!< Parameter valid check for transmit instruction protocol */
#define IS_VALID_TRANS_INSTRUCT_PROTOCOL(x) \
    ((QspiProtocolExtendSpi == (x)) ||      \
     (QspiProtocolTwoWiresSpi == (x)) ||    \
     (QspiProtocolFourWiresSpi == (x)))

/*!< Parameter valid check for serial interface read mode */
#define IS_VALID_INTERFACE_READ_MODE(x)      \
    ((QspiReadModeStandard == (x)) ||        \
     (QspiReadModeFast == (x)) ||            \
     (QspiReadModeTwoWiresOutput == (x)) ||  \
     (QspiReadModeTwoWiresIO == (x)) ||      \
     (QspiReadModeFourWiresOutput == (x)) || \
     (QspiReadModeFourWiresIO == (x)) ||     \
     (QspiReadModeCustomStandard == (x)) ||  \
     (QspiReadModeCustomFast == (x)))

/*!< Parameter valid check for QSSN valid extend delay time */
#define IS_VALID_QSSN_VALID_EXTEND_TIME(x) \
    ((QspiQssnValidExtendNot == (x)) ||    \
     (QspiQssnValidExtendSck32 == (x)) ||  \
     (QspiQssnValidExtendSck128 == (x)) || \
     (QspiQssnValidExtendSckEver == (x)))

/*!< Parameter valid check for QSSN minimum interval time */
#define IS_VALID_QSSN_INTERVAL_TIME(x)  \
    ((QspiQssnIntervalQsck1 == (x)) ||  \
     (QspiQssnIntervalQsck2 == (x)) ||  \
     (QspiQssnIntervalQsck3 == (x)) ||  \
     (QspiQssnIntervalQsck4 == (x)) ||  \
     (QspiQssnIntervalQsck5 == (x)) ||  \
     (QspiQssnIntervalQsck6 == (x)) ||  \
     (QspiQssnIntervalQsck7 == (x)) ||  \
     (QspiQssnIntervalQsck8 == (x)) ||  \
     (QspiQssnIntervalQsck9 == (x)) ||  \
     (QspiQssnIntervalQsck10 == (x)) || \
     (QspiQssnIntervalQsck11 == (x)) || \
     (QspiQssnIntervalQsck12 == (x)) || \
     (QspiQssnIntervalQsck13 == (x)) || \
     (QspiQssnIntervalQsck14 == (x)) || \
     (QspiQssnIntervalQsck15 == (x)) || \
     (QspiQssnIntervalQsck16 <= (x)))

/*!< Parameter valid check for QSCK duty correction */
#define IS_VALID_QSCK_DUTY_CORR(x)   \
    ((QspiQsckDutyCorrNot == (x)) || \
     (QspiQsckDutyCorrHalfHclk == (x)))

/*!< Parameter valid check for virtual cycles */
#define IS_VALID_VIRTUAL_CYCLES(x)       \
    ((QspiVirtualPeriodQsck3 == (x)) ||  \
     (QspiVirtualPeriodQsck4 == (x)) ||  \
     (QspiVirtualPeriodQsck5 == (x)) ||  \
     (QspiVirtualPeriodQsck6 == (x)) ||  \
     (QspiVirtualPeriodQsck7 == (x)) ||  \
     (QspiVirtualPeriodQsck8 == (x)) ||  \
     (QspiVirtualPeriodQsck9 == (x)) ||  \
     (QspiVirtualPeriodQsck10 == (x)) || \
     (QspiVirtualPeriodQsck11 == (x)) || \
     (QspiVirtualPeriodQsck12 == (x)) || \
     (QspiVirtualPeriodQsck13 == (x)) || \
     (QspiVirtualPeriodQsck14 == (x)) || \
     (QspiVirtualPeriodQsck15 == (x)) || \
     (QspiVirtualPeriodQsck16 == (x)) || \
     (QspiVirtualPeriodQsck17 == (x)) || \
     (QspiVirtualPeriodQsck18 == (x)))

/*!< Parameter valid check for WP pin output level */
#define IS_VALID_WP_OUTPUT_LEVEL(x) \
    ((QspiWpPinOutputLow == (x)) || \
     (QspiWpPinOutputHigh == (x)))

/*!< Parameter valid check for QSSN setup delay time */
#define IS_VALID_QSSN_SETUP_DELAY(x)        \
    ((QspiQssnSetupDelayHalfQsck == (x)) || \
     (QspiQssnSetupDelay1Dot5Qsck == (x)))

/*!< Parameter valid check for QSSN hold delay time */
#define IS_VALID_QSSN_HOLD_TIME(x)         \
    ((QspiQssnHoldDelayHalfQsck == (x)) || \
     (QspiQssnHoldDelay1Dot5Qsck == (x)))

/*!< Parameter valid check for interface address width */
#define IS_VALID_INTERFACE_ADDR_WIDTH(x) \
    ((QspiAddressByteOne == (x)) ||      \
     (QspiAddressByteTwo == (x)) ||      \
     (QspiAddressByteThree == (x)) ||    \
     (QspiAddressByteFour == (x)))

